export const zhengGe = {
  // 伏吟格
  fuYin:
    "伏吟\n主有灾难，祸不单行，多重，伏地痛苦呻吟之象。凡事宜静不宜动，宜缓不宜速。只宜收敛货财，讨债等。伏吟多主静象，如逢冲格，九天，马星等，又为静而不静，静中思动之象。",
  jinFuYin: "金加金主道途分异，斗伤呻吟，凡事不顺。",
  muFuYin: "木加木主非灾飞祸，争财竞禄，求谋难成。",
  shuiFuYin: "水加水口舌盗贼，阴私相侵，凡事困窘。",
  huoFuYin: "火加火口舌飞祸，疾病相畏，凡事有始无终。",
  tuFuYin: "土加土住居烦恼，又主行事迟缓，虽成而迟等。",

  // 进退格
  jinRu: "进茹格\n进茹臧否喜向前，进象进趋景色妍。",
  tuiRu: "退茹格\n退茹退步忧愁去，休咎皆宜步回旋。",
  qianJian: "前间格\n前逢拦阻为前间，进步中途有阻隔。",
  houJian: "后间格\n后者拥扶因后隔，退后当中犯艰难。",

  // 合格
  shangHe: "上合格\n上亲于下下人欢。",
  xiaHe: "下合格\n下恭于上上保安。",
  heTu: "合土格\n合土耕种宜农圃。",
  heJin: "合金格\n合金钱财宜兵权。",
  heShui: "合水格\n合水漂泊宜淫私。",
  heMu: "合木格\n合木发生宜市贾。",
  heHuo: "合火格\n合火文书策功名。",

  // 冲格
  zhengChong: "正冲格\n正冲庚上忽加甲，对面冲锋毋拘牵。",
  beiChong: "背冲格\n背冲甲上庚相见，背地攻击可凯旋。",
  muChong: "木冲格\n木冲须宜用义宣。",
  huoChong: "火冲格\n火冲用文及用火。",
  jinChong: "金冲格\n金冲先要扬威武。",
  shuiChong: "水冲格\n水冲行智并行船。",

  // 生格
  haoQi: "耗气格\n我之财物不周全。主我帮助他人，而伤了我的骨血，脱耗我的精华。",
  duoQuan:
    "夺权格\n我之权衡被人夺。主我帮助他人，而伤了我的骨血，脱耗我的精华。",
  jiaoYin:
    "交阴格\n隐匿阴私利伏藏。主有叔嫂交淫之象，主有尊卑失礼的阴谋有害于我。",
  jiaoYang:
    "交阳格\n脱我精神我有伤。主有叔嫂交淫之象，主有尊卑失礼的阴谋有害于我。",
  deMu: "得母格\n家中喜悦庆嘉祥。主有椿营并茂之象，主有长上之人恩重于我。",
  huoFu: "获父格\n福德贵人在身旁。主有椿营并茂之象，主有长上之人恩重于我。",
  yiShi: "倚势格\n赖恃他人我得扬。主他人尽力帮助于我，而获其资助，增我神气。",
  chengQuan:
    "乘权格\n假势兴隆大吉昌。主他人尽力帮助于我，而获其资助，增我神气。",

  // 克格
  waiQin:
    "外侵格\n外人欺我要提防。主事从外入，需防外人欺凌；为有人主动来找我。",
  neiQin: "内侵格\n家中欺我意不良。主事从内起，需防内人刑害；为我主动去找人。",
  waiHai:
    "外害格\n灾殃陡起在他乡。主事从外入，需防外人欺凌；为有人主动来找我。",
  neiHai: "内害格\n是非口舌家淫猖。主事从内起，需防内人刑害；为我主动去找人。",
  waiZhi:
    "外制格\n他人欺辖隐钩铠。主事从外入，需防外人欺凌；为有人主动来找我。",
  neiZhi: "内制格\n家里翻腾欲寻殃。主事从内起，需防内人刑害；为我主动去找人。",
  waiLuan:
    "外乱格\n外国来兵要侵疆。主事从外入，需防外人欺凌；为有人主动来找我。",
  neiLuan: "内乱格\n家里纷纷无主张。主事从内起，需防内人刑害；为我主动去找人。",
  jinMuKeGe: "金木相加：主官事，口舌斗争。",
  shuiHuoKeGe: "水火相乘：主惊忍，妇女不安。",
  tuShuiKeGe: "土水相克：主遗财患病，争竞家园。",
  muTuKeGe: "木土相犯：主牢狱口舌，争财夺利。",
  huoJinKeGe: "火金相见：主怪异血光，突发灾难。",

  // 刑格
  liuYiJiXing:
    "六仪击刑\n刑宫有就起忧煎，是非伤损恐难免，时干年命最忌此，官司惟恐犯官刑。",

  // 支破格
  zhiPo: "支破格\n支破无成灾祸息，谋为难就有冲突。",
};

// 辅格
export const fuGe = {
  quZhi: "曲直格\n大利军家施号令，探听敌弊合经营。又为仁寿格。",
  yanShang: "炎上格\n文书南策为最吉，用火乘风可进功。为虚冲，宜文治。",
  jiaSe: "稼穑格\n大力守边并下寨，安营乐业与雕薨。宜耕耘造作。",
  congGe: "从革格\n教军演队宜操矛，劫敌发兵功最优。为肃杀，宜武功。",
  runXia: "润下格\n调河治水兼水战，斗智乘船向此游。又为含羞格。",
  taiXi: "胎息格\n谋为从兹当进步，君子欣扶事有成。又为发生格。",
  zengHui: "增辉格\n文章显达功名进，举火出军勃然兴。利于飞黄腾达。",
  bianXiang: "变象格\n资生万物而成器，进步元亨万里程。宜窑灶砖瓦。",
  yangWei: "扬威格\n兴兵练阵皆其吉，乐道采丹向此修。利建侯称霸。",
  tongGuan: "通关格\n迎锋见阵皆为吉，财利功名任所求。利筹策水利。",
  cuiCan: "摧残格\n凡事必须耗我心力，威服他人而始能有成，不然则有伤害于他人。",
  liFa: "罹伐格\n此格不利出军去，谋作交兵定震惊。主斗争惊恐。",
  yanMu: "掩目格\n掩目灭光为其号，溺身死地犯狱刑。主阴暗隐蔽。",
  huaiTi: "坏体格\n伤身损命犹劳力，退守为宜毋进兵。主禁锢，利坚贞。",
  biKou: "闭口格\n他人闪赚伤于我，途道绝粮切勿谋。主冤仇血光。",
  jueJi: "绝迹格\n伤其形质坏其身，疾病官灾一时陡。主疾病牵缠。",
  poJing:
    "破精格\n凡事必须伏服于他人之下，卑躬折节而始能有成，不然则会受到他人迫害。",
  fenLin: "焚林格\n守旧为宜固本美，毋须前进并争锋。宜防火。",
  shiGuang: "失光格\n前进必然招脱耗，破财破产坏元精。莫登程。",

  jueJing: "绝精格\n耗散元阳失本面，诸般谋作一场空。事不通。",

  xiejin: "泄津格\n此象须防人陷我，钱财败损又添忧。怕消沉。",

  baiYuan: "败源格\n诸般谋作皆费力，归去空空似浮舟。有忧愁。",

  shiLi: "失利格\n凡事必须辅佐他人，保护同伴而始能有成，不然则要破财伤身。",

  xinChuang: "兴创格\n最佳造作与修筑，主客交锋不称情。宜持衡。",

  douLi: "斗力格\n口舌兴词概因此，逢之迅速退步停。事难宁。",

  poShui: "迫水格\n田国致讼终耗力，交战出军损兵丁。慎官刑。",

  fengRen: "逢刃格\n伤其体兮败其形，口舌争斗命残朽。有凶咎。",

  mieRun: "灭润格\n利于淫邪私情事，非灾即祸将身囚。乃无荣。",

  // 星门
  fuYin:
    "伏吟\n主有灾难，祸不单行，多重，伏地痛苦呻吟之象。凡事宜静不宜动，宜缓不宜速。只宜收敛货财，讨债等。伏吟多主静象，如逢冲格，九天，马星等，又为静而不静，静中思动之象。",
  fanYin:
    "反吟\n主反复不宁，进后复退，聚而复散，徘徊不定，犹豫不决，半途而废之象。凡事多重复而为，宜快刀暂乱麻，速战速决，宜于发散货财。反吟多主动象，如反吟逢合，则又是动而不动之象。",

  // 门
  menPo:
    "门迫宫\n主祸从外来。我居宫室之内，并不欲招非于他，他突然来克我，不知有何关碍，迫来之事最为迅速，要多堤防。",
  menShouZhi:
    "门受制\n主内祸重重。因为我安居无事他却过来惹我，我以郑重克服于他，他也甘受我制，主我侵犯于他。",
  jiaoHe:
    "门交和\n主喜庆重重。我居穷困之际，并无意去求他，他不辞劳苦，主动来帮助我，我也愿意接受他的帮助。主因外人相助而有喜庆。",
  jieYi:
    "门结义\n主喜中有脱。他人不远于里而来奔于我，我也念其诚意，接之以礼，予之以仪。主乐善好施，他人受益。",
};

export const xingInfo = {
  tianPeng:
    "天蓬\n五行：水\n意：偷盗，抢劫，险阻。\n天：雨，水灾。\n人：聪明伶俐，能言善辩，智慧，计谋，小人，投机，敌将，江湖人。\n性情：圆融果敢，大胆妄为，贪婪，敢于冒险，喜欢暗中行事，多情多欲，贪酒恋花。\n形态：庄严，威猛，彪悍，精干，面黑或眼大。\n宜：安边定国，修筑城池，兴工动作，屯兵固守，保镇一方。\n忌：入宅，修造，祭祀，交易。",
  tianRui:
    "天芮\n五行：土\n意：疾病，毛病，吝啬，交往。\n天：雾，昏暗。\n人：奸臣，姑母，母辈，奸诈，乡民，工匠，僧道，凡事迟滞难成。\n性情：忠厚老实，任劳任怨，倔强，勤奋，有韧性但固执，保守，小气，缺乏开拓精神。\n宜：结交好友，宗道学习，屯兵固守，培养锐气，安静为吉。\n忌：嫁娶。",
  tianChong:
    "天冲\n五行：木\n意：权威，战斗，变化，躁动。\n天：雷，风。\n人：武士，车夫船夫，胆大，发展快速，沖动，脆弱。\n形态：直，高，长方脸，长发，梳抓鬓的人，身体瘦长。\n性情：性子急，工作麻利，为人爽快，敢打敢冲，好出风头，不稳重，好冲动，做事多为欠思考，不顾后果，意识冲动，也表示有闯劲，开拓性，办事不拖泥带水，雷厉风行，有勇气，积极进取。",
  tianFu:
    "天辅\n五行：木\n意：辅助，媒介，文化。\n天：风。\n人：女人，考试，文书，教学，文雅。\n形态：身体细长，发缜密，脸青白，手细长。\n性情：文雅，谦虚，有修养，有文化，有风度，仁慈面善，测事多和谐，融洽，相互谦让，有君子之风。\n宜：修礼访道，嫁娶，交易，修造，遭葬，出师。\n忌：百事不忌。",
  tianQin:
    "天禽\n五行：土\n意：正直，稳定，平衡。\n天：阳时为云，阴时为雾。\n人：均旺，元帅，胖子，中正端庄。\n形态：偏胖，方圆。\n性情：正直，情绪稳定，端庄，顽固，忠良。\n宜：祭祀，请福除恶，集合，聚会。\n忌：百事不忌。\n",
  tianXin:
    "天心\n五行：金\n意：医药，贵重，公开，运行。\n天：雪，春夏为雨。\n人：医师，领导，直爽，原话，善良，秀才，官人。\n形态：圆形，高大，威严，雄伟。\n性情：聪明能干，精明机智，有领导才能，乐善好施，攻于心计，阴柔细腻，测试为策划周密，进退自如，能惩恶助善。\n宜：治病，求药，嫁娶，入官，修造，交易。\n忌：百事不忌。",
  tianZhu:
    "天柱\n五行：金\n意：破败，伤灾，色情，美貌。\n天：霜，阴天，春夏为雨。\n人：少女，口舌，淫邪，桃花，哭喊。\n形态：面白，方圆脸，唇薄，身体健壮。\n性情：口舌是非，能说会道，好斗争讼，为能言善辩。\n宜：固守，辩论，阴谋，隐藏。\n忌：迁移，入官，交易。",
  tianRen:
    "天任\n五行：土\n意：稳重，平稳，吉利，财运，积累。\n天：云。\n人：少男，养生，忠厚，农夫。\n形态：弯腰驼背，胸部丰满，方脸重眉。\n性情：忠厚老实，任劳任怨，倔强，勤奋，有韧性但固执，保守，小气，缺乏开拓精神。\n宜：运筹，调理，求财。\n忌：迁移。",
  tianYing:
    "天英\n五行：火\n意：烈性，没理，火光，光明。\n天：晴，旱灾，火灾。\n人：文化教育，文字，信息，虚荣，文人墨客。\n形态：瓜子脸，面红白，身体瘦，头发较黄。\n性情：声音焦脆，礼貌虚伪，焦躁不安，易怒。\n宜：远行，作乐，饮食，上书，献策。\n忌：行兵，交易。",
};

export const menInfo = {
  xiuMen:
    " 休门\n 五行： 水\n 意： 修养，休闲，聚会，娱乐，喜庆，休养生息，休闲，懒散，旅游，休息，漫不经心，调养，调理，整理，美容，美发，死亡。\n 事： 婚姻，收益进财，贵人相助。\n 人： 品质高贵之人，美容美发，白领，护士，护理人员，离退休人员，清闲休闲之人，懒散之人，睡觉者，死人。\n 性情： 安然，漫不经心，懒散倦怠，性情温顺，没有活力。\n 形态： 漂亮，美丽，气质好，语音偏低，语速偏慢，着装宽松，休闲，半睁着眼的人，不慌不忙。\n 物品： 饮料，酒，油，盐，酱油，醋，调料，水，油器，汽油，煤油，柴油，润滑油等液体物质，布匹，绳索，衣物，棉花海绵等松软物质，船，汽车，火车，自行车， 电瓶车，摩托车等运输工具，钟表，风扇，洗衣机，空调等能动的家电。\n 动物：金鱼，毛虫，蜗牛，水牛，黄牛等性情温顺，动作缓慢的动物，水中动物，栖息在沼泽中的动物，喜水的动物。\n 宜：面试，谒贵，赴任，嫁娶，求财，交易，营建，喜乐等。\n 忌：行刑，杨威。\n 休门动应：休门三十阴贵人，衣着蓝黄及碧青。出此门三十里，见阴贵人，或五十里，见蛇，鼠，水物。",
  siMen:
    " 死门\n 五行： 土\n 意： 执着，不灵活，没有变化，丧失生命，没有生命，不可调和，固定不变，不可周转，断了念头。\n 事： 主死丧，刑狱，田士，坟墓，疾病，凶灾之事，运气凝滞\n 人： 死人，执着的人，不灵活的人，死板的人，不能变通的人，固执的人， 行刑之人，屠夫。\n 性情： 固执迟钝，稳重保守，死心眼，死气沉沉，死不认账，一条路走到黑，不灵活。\n 形态： 脸色呆板，木纳，不灵活，死板。\n 物品： 雕塑，木偶，死人照片，凶器，绳索，枷锁，医疗器械，墓碑，俑\n 动物： 牛，羊，动物的尸体。\n 宜：决刑，断狱，吊丧，埋葬，捕猎，宰杀，断绝，收尾等。\n 忌：余事皆忌。\n 死门动应：死门二十逢疾病，黄皂衣人见遭迪。出此门二十里，逢有疾病。或五十里，五里内，见血光。远行不还家，嫁娶伤家长，新妇凶。 ",
  shangMen:
    " 伤门\n 五行： 木\n 意： 震动，伤残，争斗，变动，鲁莽，冲动，巨响，损害，消耗，抓捕。\n 事： 争斗，失物，捕捉盗贼，运输赌博，伤心，讨债。\n 人： 公安，军警，斗殴者，讨债人，竞争对手，伤心人，驾驶员，手术医生，受伤者。\n 性情： 性情直爽，不拐弯抹角，雷厉风行，易怒，暴躁，粗野。\n 形态： 威严，恐惧，难看，丑陋，长方脸，面部少有笑容，健壮。\n 物品： 刀，剑，剪子，针，枪，炮，子弹，弓箭，锐器，炸药，武器，毒药，毒气，等一切使人伤亡的物质，破裂不完整的物质。\n 动物： 狮子，老虎，狗，鹰，豹子，蚊子，跳蚤，马蜂等一切能够伤人和骚扰人的动物。\n 宜：捕捉，讨债，赌博，比赛，渔猎，收敛财务。\n 忌：余事皆忌。\n 伤门动应：伤门三十争讼起，凶人着皂血光腥。出此门三十里，有争讼出血之人。 ",
  duMen:
    " 杜门\n 五行： 木\n 意： 阻塞，阻止，困难，限制，闭塞，隐藏，覆盖，遮掩，关闭，断绝，技术， 艺技，体会到的，感觉到的。\n 事： 保密，躲藏，出行避难等。\n 人： 技术人员，理论工作者，管理学者，公检法，安全保密人员，狱警，军人，聋哑人。\n 性情： 不爱言语，心平气和，文静内向。\n 形态： 晦涩，呆滞，深色安然。\n 物品： 书籍，报刊，门窗，瓶塞，瓶盖，衣物，被子，窗帘，内衣，胸罩。\n 动物： 夜行动物，黄鼠狼，老鼠，猫，狗，猫头鹰，蚊子。\n 宜：逃难，躲避，躲藏，除害，防洪，闭关，填沟。\n 忌：余事皆忌。\n 杜门动应：杜门二十男女辈，绢皂褐碧相从行。出此门二十里，见男女同行。或六十里，见恶人，日奇临，二女人身着青衫；月奇临，主烽火；星奇临，弓驾应。 ",
  zhongMen:
    " 中五\n 五行： 无\n 意： 无路可走，无所适从，不知所措。\n 事： 谋求动静，不知所措，寻求帮助，寻求答案。\n 人： 中间人，中介。\n 宜：安居乐业，静守不动。\n 忌：余事皆忌。 ",
  kaiMen:
    " 开门\n 五行： 金\n 意： 公开，暴露，开放，开创，开始，开明，开朗，打开， 手术，顺利，通畅，经营，经济，升迁，出行，贸易 ，分手，分开，离婚。\n 事： 主动身远出，功名词公，工作事业，者试升迁，开业等。\n 人： 领导，公务员，白领，公众人物，公司企业老板，创业者，法官，检察官，生意人。\n 性情： 豁达爽朗，谈吐不凡，坦诚无私，性情愉快，无所拘束，意志活跃，思想开放，通情达理，容易沟通，讲情重义，自尊心强，勤奋好学。\n 形态： 脸方顶圆，鼻正口方，上身长直，不怒而威。\n 物品： 金银饰品，贵重物品，圆形物品。\n 动物： 虎，狮，豹，马，天鹅，龙。\n 宜：见贵，参官，远行，考学，求职，贸易，公事，搬迁，征战。\n 忌：嫁娶，政治，阴谋，隐私，有人窥探。\n 开门动应：开门二十阴人至，贵人乘马紫衣襟。出此门二十里，见贵人着紫骑马。四十里内，见猪马，逢酒食，万事吉，锣鼓鎗刀，妇人担伞至，手执物，抱孩儿。 ",
  jinMen:
    " 惊门\n 五行： 金\n 意： 惊恐，奇怪，刺激，吃惊，诧异，惊慌，恐慌，声音，官非，口舌是非，抖讼，忧疑，音乐，响声。\n 事： 主口舌争执，宫讼是非，欺诈怪异，虚惊恐惧等。\n 人： 律师，教师，音乐家，歌星，纪检监察人员。\n 性情： 惊恐不安，担惊受怕，忐忑不安，心事重重。\n 形态： 瞠目结舌状，大眼睛，嘴闭不上，呆若木鸡状。\n 物品： 风铃，音响，电视，电话，钟表，乐器，鞭炮，一切能发声的物体。\n 动物： 蝉，蛙，蝈蝈，蟋蟀，黄鹂，麻雀，等一切善于鸣叫的生物。\n 宜：斗讼官司，捕盗，擒奸，赌博，欺诈，设疑恐吓。\n 忌：余事皆忌。\n 惊门动应：惊门三十鸦鸣噪，官状相逢六畜椁。出此门三十里，见鸦鹊官状，六畜牴触之事。十里内有损物，四十里二人争打，如无康惊。 ",
  shengMen:
    " 生门\n 五行： 土\n 意： 有发生安闲，财帛，生机，生长，生意，生产，生命，家宅，压盛之意。\n 事： 建造，生意，求生，耕种，贸易求财。\n 人： 工作者，生产者，生意人，孕妇，从事金融机构者，经理，律师，医生。\n 性情： 忠厚，守时，诚恳，乐观，稳重。\n 形态： 方脸，厚唇，鼻子方直，乐观向上。\n 物品： 利于人们生活所需的一切物品，贵重物品，值钱物品。\n 动物： 泛指一切动物。植物：泛指一切植物。\n 宜：治病求安，买卖经商，征讨，谋望，求财，入官见贵，嫁娶，营造，耕种养殖。\n 忌：埋葬，吊丧，杀生。\n 生门动应：生门十五逢公吏，官人着紫皂衣巾。出此门十五里，有紫衣公吏官人。或六十里，见贵人车马。 ",
  jingMen:
    " 景门\n 五行： 火\n 意： 张大虚花，发扬振作，实破，学习，文化，文书，证件，书信，火电，计划，谋划。\n 事： 主音信行人，文书华鬆，酒食宴会，或有小喜而不久，先吉后凶，及考试，血光之事。\n 人： 作家，老师，演员，美容师，知识分子，广告，策划，传媒，美工。\n 性情： 心直口快，脾气急躁，虚心处事，知书达理。\n 形态： 漂亮，红脸，脸尖形，身体偏瘦。\n 物品： 图书，图画，照片，图片，灯光，艺术品，首饰，时装，文件，合同，证 书，颜料，油漆，美容美发用品，书画用品，书籍，烟火爆竹，霓虹灯，电影机，电视 机，投影机。\n 动物： 雉鸡，孔雀，雄鹰，鸟类，观赏鱼，观赏动物等一切漂亮的生物。\n 宜：饮宴作乐，上书，献策，求俊招贤，谒贵拜职，远行求学，破阵突围。\n 忌：余事皆忌。\n 景门动应：景门二十惊忧事，绯皂衣人宴会宾。出此门二十里，有忧惊事。三十里外，见赤身人，或火蛇，七十里，水火失物。 ",
};

export const ganInfo = {
  yi: "乙\n乙为轧\n天：日。\n地：花草，藤蔓。\n人：妻子，术士。\n概念：弯曲，柔顺，间接辅助，善良，犹豫。\n身：肝，颈，手，经络。\n物：床，桌椅，医药。",
  bing: "丙\n丙为炳\n天：月。\n地：火，电，炉灶。\n人：将军，浪子。\n概念：混乱，疾病，反叛威严，暴烈急躁。\n身：小肠，面，精气神。\n物：炉灶，电器。",
  ding: "丁\n丁为享\n天：星。\n地：人烟，香火。\n人：文士，美女。\n概念：漂亮，玲珑，妩媚，文化，善变，心机。\n身：心，目，齿，舌。\n物：灯光，文书，证件。",
  wu: "戊\n戊为茂\n天：云。\n地：山岗，房屋。\n人：武人，中介。\n概念：行动，积累，中正，忠诚，宽厚，果敢。\n身：胃，胸，臀，背，鼻。\n物：钱财，资本。",
  ji: "己\n己为纪\n天：雾。\n地：丘陵，坟墓。\n人：小人，内奸。\n概念：自私，阴暗，受纳，整理，陈旧，欲望。\n身：脾，肚腹。\n物：垃圾，废品。",
  geng: "庚\n庚为更\n天：雨雪，冰雹。\n地：巨岩，大路。\n人：仇人，盗贼。\n概念：更新，阻隔，破坏，猛烈，争斗，强硬。\n身：大肠，骨骼。\n物：刀剑，金刃。",
  xin: "辛\n辛为新\n天：风。\n地：碎石，小路。\n人：囚犯，罪人。\n概念：错误，革新，压制，辛苦，问题，悲伤。\n身：肺，咽喉。\n物：珠玉，首饰。",
  ren: "壬\n王为妊\n天：雨。\n地：江河，胡海。\n人：孕妇，流氓。\n概念：孕育，变化，动态，困惑，迷茫，任性。\n身：膀胱，男生殖器，腿。\n物：茶，酒，水。",
  gui: "癸\n癸为揆\n天：露。\n地：沼泽，池厕。\n人：逃人，隐士。\n概念：调度，整合，罗网，肮脏，陷阱，隐伏。\n身：肾，生殖器，月经，四肢。\n物：醋，奶。",
};

export const shenInfo = {
  zhiFu:
    "值符\n五行：木（用的时候当做火来用）\n意：元首，领导，尊长，有权利的人，贵重的物品，贵人，靠山，重要的，有名望的。\n事：高攀接贵，财帛收益。\n人：名人，明星，领袖，领导，教授，老板，经理，管理者，负责人，长辈\n形态：方脸，粗眉，重发，鼻子直大，嘴唇方而有棱角，唇线清晰，身材长直，敦厚。\n地利：首都，首府，古建筑，庙宇，高档场所，首饰店，古董行，金矿，珠宝，煤矿，油矿。\n物品：任何重要或贵重物品。\n宜：招安，安抚，体恤。\n值符动应：贵人星，出行路上遇贵人，或高年老叟。又六甲为青龙，主财物，人从车船竹木而至。",
  tengShe:
    "螣蛇\n五行：火\n意：惊恐，虚惊，怪异，虚幻，梦境，变来变去，反反复复，曲折，虚诈，虚伪，华而不实，闪烁不定，光怪陆离，耀眼，妖艳，猜疑，狠毒，纠缠，变化，拐弯抹角。\n事：怪异，多梦，惊恐，多疑，多虑。\n人：委屈婉转，狡猾之人，善变之人，虚诈之人，变化无常之人，死缠烂打之人，漂亮妖艳之人，口舌毒辣之人，呻吟之人，疑心之人，做梦人，精神病患者。\n形态：水蛇腰，驼背，头发黄或稀少，大脑门。\n地利：弯路，海岸线，河流，烟囱，窑燥，塔吊，高压线，山脉，弯曲的建筑物，反光的建筑物，耀眼的光。\n物品：绳子，绳索，锁链，烟囱，灯，霓虹灯，烟火，汽车排气筒，蜡烛，香火，带花纹的布和衣服，渔网，腰带，鞋带，领带，项链，手链，表链，拉锁，发辫。\n宜：装神弄鬼。\n螣蛇动应：主形状古怪奇异之物，或空康花假之物，及有执物而至。客来相会，必淹滞缠扰，难于送别。忧惶惊恐，事多颠倒。",
  taiYin:
    "太阴\n五行：金\n意：隐匿，隐秘，隐私，暖昧，阴佑，阴暗，阴谋，细腻，喜庆，妇女，婢妾。\n事：主淫荡阴私，暗地感情，背地里的事情，见不得光的事情。\n人：保姆，女友，二奶，女人，私通者，少女，歌手，策划师，秘书，文人，暗中行事者，隐居者。\n形态：脸色白净，口似樱桃，鼻子挺直，身白如玉，四指如葱。\n地利：山的阴面，看不见光的房屋，地下室，潮湿的地方，洞穴，厕所，洗手间，阴暗的地方。\n物品：为雕琢品，金银，羽毛，字迹，墨迹，字画，玩具，喜庆用品，化妆品，冰，冷饮，车，碾碎机。\n宜：阴谋诡计，隐藏。\n太阴动应：女人或阴险小人。为密谋文书，又谈方术事。人从南方来引，可依托。",
  liuHe:
    "六合\n五行：木\n意：合伙，和合，婚姻，喜庆，交易，众多，逃人，勾引，组合，聚集，团体，重叠，私情，朋友，人脉，交际，证据，中介，小孩，仁慈，包容。\n事：主结好说媒，恋爱，婚姻，合作，聚会，帮忙。\n人：乐善好施之人，医生，人缘好的人，组织能力强的人，中介人，小孩，教师，僧道，基督徒，信教人，艺人。\n形态：圆脸，兔牙，一团和气，笑容可掬，点头哈腰，缩头耸肩。\n地利：草地，公园，竹林，苇塘，葱岭，树林，植物周围，东西比较多的地方。\n物品：盒子，伞，柜子，箱子结婚证书，合约，合同，证书，信印，书契，果品，布帛，衣囊。\n宜：议和，合伙，托人办事。\n六合动应：遇人必喜笑相迎，一见如故。更有美女少妇，身着新衣，相将酒食，和颜悦色，殷勤相接。",
  baiHu:
    "白虎\n五行：金\n意：凶险，灾难，阻隔，残暴，威猛，权威，冷酷，强硬，杀伐，战斗，大风，道路，地震，军警，孝服人，刀枪，伤灾，牢狱，疾病，死亡。\n事：主讲武斗兵，伤灾病丧等。\n人：技术过硬之人，好斗之人，黑社会之人，威猛之人，权力之人，义气之人，公安，军警，捕盗人，罪犯，重病人，凶杀人。\n形态：圆眼，虎头虎脑，面部表情严肃或死板，身体多肌肉，强健。\n地利：道路，关卡，收费站，悬崖，峭壁，房角，堤坝，闸口，路口。\n物品：毒品，金银，刀剑，枪枝，武器，凶器，锁，碾子，磨，石狮子，石制品，铁质品，钛制品，瓦，石，网罗。\n宜：快速，迅猛，强势。\n白虎动应：必遇新丧孝子，或白衣人，或居夫，猎户，闻啼哭之声，或残疾老人，或争斗带伤之客，或骑马而过。",
  gouChen:
    "勾陈\n五行：土\n意：勾连，迟滞，争执，反复，羁留，残忍，捕快，波折，勾心斗角，讼狱，不忠，惊恐怪异，妖言惑众，田土，土地。\n事：主争斗殴打，偷情，暗中联合，偷到等。\n人：公安，军警，具有权威得人，重刑犯，罪犯，死人，农夫。\n形态：脸色阴沉，显老。\n地利：阴暗角落，污垢很多的地方，家中老旧材质物品周围。\n物品：古董，金银，刀枪，枪支，武器，凶器。\n宜：拘禁，限制，强制，勾引。\n勾陈动应：必遇新丧孝子，或白衣人，或居夫，猎户，闻啼哭之声，或残疾老人，或争斗带伤之客，或骑马而过。",
  taiChang:
    "太常\n五行：土\n意：酒食，衣服，礼乐，宴会，司仪，头街，医药，装饰。\n事：主酒食宴会，装饰。\n人：忠厚老实，憨厚，呆呆的，固执。\n形态：体态偏厚，膀大腰圆，壮实。\n物品：食品，所有日常常见用品，酒水。\n宜：酒食，贿赂。",
  xuanWu:
    "玄武\n五行：水\n意：偷盗，破耗，灵活，奸淫，欺骗，诡谲，玄学，神秘，小人，旁门，不正，逃亡，阴险，醉汉，污染，污秽，小偷，偷盗，偷情，谎言，阴谋，诡计。\n事：主被偷行窃，破财，上当受骗等。\n人：聪明多智者，能言善辩者，诚信不高者，爱说谎话者，骗子，醉酒之人，盗贼，娼妇，第三者。\n形态：贼眉鼠眼，神色不定，弯腰驼背，肩窄腿细，视力衰退。\n地利：阴沟，地井，下水道，地窖，地下室，不见光的场所，低洼地，河流，池塘，湖泊，污水，粪便，厕所，洗手间，厨房。\n物品：图片，图画，文章，印信，盐，酱，醋，油，酒，油漆，伞，碳，一切流体类物质；瓶，罐，瓢，缸等容器。\n宜：剽窃，欺诈，暗中操作。\n玄武动应：必遇盗贼，或奸人刺客，或儿童小子，或讲元门课卜之士，或逃亡走审窘迫之人。",
  zhuQue:
    "朱雀\n五行：火\n意：文书，文化，信息，文字，口舌，能言善辦，玄虚，虚伪，不可靠，琢磨不透，神秘，谋划。\n事：主讲文斗口，文书信息等。\n人：文人，能说会道者，律师，骗子，智者，不诚实者，醉汉，演员，导演。\n形态：脸型偏尖，脸上肉不多，精神状态不错。\n地利：潮安，来水，去水，道路，阳光照射出，有光的地方。\n物品：文书，画，纸张等。\n宜：说服，消息，辩论，争吵。\n朱雀动应：必遇盗贼，或奸人刺客，或儿童小子，或讲元门课卜之士，或逃亡走审窘迫之人。",
  jiuDi:
    "九地\n五行：土\n意：稳定，隐秘，暗地，缓慢，保守，长久，踏实，安静，低矮，疾病，暗疾，神鬼，幽冥，埋伏，储蓄，吝啬，消极，陈旧，低调，包容，博大，关怀，缓慢，困惑。\n事：主谋产寻穴，疾病，家宅，地皮等。\n人：乡农，医生，老妇人，道姑，村姑，狱警，地下工作者，不公开的职业，吝啬之人，慢吞吞的人，性格柔顺，自私消极的人。\n形态：大腹，肥厚，方脸多肉，肥胖，身材五短，声音如瓮。\n地利：地基，地窖，低洼地带，地下室，地道，地下铁，地摊，地下水，地炉，地炕，矮处。\n物品：五谷，布帛，沙石，缸，瓦盆，瓦罐，土制品，储存粮食的器皿，储存衣物的柜子，首饰盒。\n宜：安静，安居，隐藏，保守，稳重，播种养殖。\n九地动应：必遇暫日老病，心多忧患之人，或新丧者，或算命卜祝之人，说鬼神幽冥之事。",
  jiuTian:
    "九天\n五行：金\n意：刚强，好动，发扬，威武，喧闹，变迁，远行，虚荣，好高慕远，不切实际，开豁，高调，吹噓，显摆，高大。\n事：主行欢作霸，出行变迁等。\n人：领导，首脑，长辈，父辈，有威望之人。\n形态：高大，魁梧，威严，脸方正，手绵软，言语掷地有声。\n地利：天井，天车，开阔地，高原，高空，高大建筑，首府，办公室，经理室，豪华地方，楼房最高层，高处。\n物品：金玉，宝石，高耸，剑戟，刀枪，钱，镜子，铜铁，帽子，眼镜，水果，光亮玲珑物，旋转或动物，飞机。\n宜：奋发，杨威，显耀，发散，快速。\n九天动应：出行必遇响声，或口舌争斗。或屠夫，兵卒，手中执有兵器物件。",
};

export const baGuaInfo = {
  qian: "乾\n乾三连，乾健也\n天时：天晴，雹，霰，雪，冰，霜。\n地理：京都，大郡，名胜之地，高亢之所。\n时序：立冬，成亥年月日时。\n方位：西北方，上，右后方。\n人物：君，父，大人，老人，长者，统帅，官宦，名人，公门中人。\n身体：头，首，面颊，骨，肺，右腿。\n性情：刚健正直，自重好高，勇武果决，威严。\n人事：圆成，循环，顺畅，初始，扩大，多动少静，。\n屋舍：公榭，楼台，高堂，大厦，驿舍，宅形圆，西北向之居。\n动物：马，龙，狮，象，雁，鹏，鹤，雀，鹰，鹗，天鹅。\n静物：金玉，珠宝，水品，圆物，刚物，贵物，木果，镜子。\n数目：一，六。",
  kan: "坎\n坎中满，坎陷也\n天时：月，云，雨，雪，露，霜。\n地理：江海池井，沟渎，穴坑，凡有水卑湿之地。\n时序：冬至，及子年月日时。\n方位：北方，后面，下面。\n人物：中男，江湖之人，盗贼，黑色人，匪徒。\n身体：耳，肾(泌尿生殖系统)，血，膏，发。\n性情：外柔内刚，心机阴险，智随方圆。\n人事：辛苦劳碌，险陷卑下，外柔内刚，起伏不定，漂泊不定，随波逐流，灾难忧郁。\n屋舍：江楼，水阁，茶坊，酒肆，近水居，色情场所，黑暗之地，向北之居。\n动物：水中之物，鱼，螺，豕，鹿，象，狐，燕，多骨之物。\n静物：水中物，水晶，弓轮，桎梏，栋梁，酒，盐，酱，黑物，带核，矮柔之物，从棘，藜，不规则形状之物。\n数目：一，五，六。",
  gen: "艮\n艮覆碗，艮止也\n天时：云，雾，烟，山岚气。\n地理：山径路，近山城，坟墓，丘陵，小土石，门阙。\n时序：立春，冬春之交，丑寅年月日时。\n方位：东北方，左后方。\n人物：少男，闲人，山中人，童子，阍寺，仆隶，保安，皮色黄肿之人。\n身体：手指，鼻，背，脾胃。\n性情：保守迟缓，濡滞多疑，呆板顽固，诚实守信，稳重憨厚。\n人事：阻滞艰难，反背隐瞒，止住不见，静止安定，鬼门，鬼怪。\n屋舍：东北方之居，近石，近路之宅，山居，宗庙，阍寺，墙。\n动物：狗，鼠，狐，虎，牛，长嘴兽，鸦，鹊，鹄，啄禽。\n静物：土石，黄色物，瓜果，土中之物。\n数目：八，七。",
  zhen: "震\n震仰盂，震动也\n天时：雷，烈风。\n地理：闹市，大途，草木茂盛之所，运动场，歌舞厅，飞机场。\n时序：春分，卯年月日时。\n方位：东方，左边。\n人物：长男，客商，将士，匠工，多胡子，乘务员，司机。\n身体：足，肝，发须，精神。\n性情：暴躁刚直，意气风发，好动易怒。\n人事：惊恐多噪，震动奋起，多动少静，迅速喧哗,，有声有响，有名无实。\n屋舍：市宅，门户，闹市，楼阁，庙宇，山林之处，东向之居。\n动物：龙，蛇，雀，鹭，善鸣之马，虫，蜂，蝶。\n静物：木竹，萑苇，嫁鼓，席，柴，竹，木，乐器，生花之木，系解之物。\n数目：三，四。",
  xun: "巽\n巽下断，巽入也\n天时：风。\n地理：草木茂盛之所，花果菜园，气味浓厚之地。\n时序：立夏，春夏之交，辰巳年月日时。\n方位：东南方，左前方。\n人物：长女，命妇，寡妇，僧尼，山林仙道，秀士，术士，白眼人。\n身体：股肱，胆，肠，气，寡发，白眼。\n性情：柔和谦逊，优柔寡断，心情起伏，轻浮。\n人事：进退不决，利市三倍，荐举呈发，申审号令，自由，徘徊，发散，传播运输。\n屋舍：寺观楼阁，山林之居，东南向。\n动物：飞禽，走兽，山林中善鸣虫，鸟，鸡，鹅，鸭，蛇。\n静物：竹，木香，长直高物，绳，草卉，衣物类，竹木工巧之器，帆，扇。\n数目：四，五。",
  li: "离\n离中虚，离丽也\n天时：晴日，电，虹，霓，霞。\n地理：干亢，窑灶，炉冶之所，刚燥之地，面南之所，校园，文化场所。\n时序：夏至，及午火年月日时。\n方位：南方，前面，上面。\n人物：中女，文人，大腹人，目疾人，甲胄之士。\n身体：日，心，上焦，小肠(腹)。\n性情：躁急，虚伪，开朗聪明，爱美，打扮，见事明了。\n人事：文明，文化之事，才学，美，明亮，干裂，虚心。\n屋舍：殿堂，中堂，檐，厨灶，南向，阳明之居，明窗，虚室。\n动物：文彩之鸟，凤，雉，鹌鹑，龟，鳌，螺，蚌，有壳之物，牝羊，蟹。\n静物：火，文书，甲胄，干戈，槁木，干燥之物，赤色，七彩物，花叶，枯枝。\n数目：九，六，三。",
  kun: "坤\n坤六断，坤顺也\n天时：阴云，雾气，冰霜。\n地理：平地，田野，乡里，郊区，广场。\n时序：立秋，未中年月日时。\n方位：西南方，右前方。\n人物：后妃，母亲，老妇，农夫，乡人，众人，大腹人。\n身体：腹，脾胃，肉，右胳膊。\n性情：柔懦，吝啬，迟钝，从容，宽容。\n人事：平顺，吝啬，众多，均平，包容，含蓄，收藏，依赖，懦弱，消极，缓慢，土建。\n屋舍：西南向之居，墙壁，村舍，田舍，矮屋，土阶，土库，春碓，厕所，仓库。\n动物：牛，牝兽，百兽，牝马。\n静物：方，柔物，釜，舆，布帛，五谷，土中物，有柄物，瓦器，丝绵。\n数目：二，八。",
  dui: "兑\n兑上缺，兑说也\n天时：新月，星辰，冬雪，春夏亦重雾，细雨。\n地理：沼泽，刚卤地，坍地，山崩破裂之地，缺池，废井。\n时序：秋分，酉金年月日时。\n方位：西方，右边。\n人物：少女，妾，婢，歌妓，伶人，巫师，露齿破相之人。\n身体：口，舌，肺，气管。\n性情：好饮食，谤说，多喜说唱，快乐，伶俐，冷艳。\n人事：喜悦，娱乐，口舌，毁谤，相欺争打，损折断裂，残缺，暗昧，又主饮食。\n屋舍：近泽居，坏墙壁，门户有损，西向之居。\n动物：泽中之物，虎，豹，羊，鹭，猿，鹿。\n静物：五金物，钟，废缺物，修补物，乐器，有口器，金刃，金类，毁折之物。\n数目：七，八，二。",
};

export const shenSha = {
  deShen: "德神：主财利福德，助吉抑凶，又为君子，学者。",
  luShen: "禄神：主钱财，福禄，工作，饮食等。",
  waiTaoHua: "外桃花：明目张胆，在外放流",
  guiRen: "贵人：主逢凶化吉，有贵人帮扶。",
  yiMa: "驿马：为动迁之神，主出行，变动。",
  huiMa: "回马：主动身回家，返回原地。",
  poSui: "破碎：即金神，又名红砂。主物破，破财，血光，刀刃之伤等。",
  jieSha:
    "劫煞：主劫盗伤杀之事，也主快速之意。带白虎，玄武等临用神必有劫盗之应。",
  neiTaoHua: "内桃花：也为暗桃花，主暗地里偷偷摸摸。",
  huaGai: "华盖：主人暗昧不明，有屈难伸，并主与术数宗教有缘。",
  tianDe: "天德：主消除忧祸，逢凶化吉，化险为夷。",
  yueDe: "月德：主消除忧祸，逢凶化吉，化险为夷。",
  tianMa:
    "天马：主迁动，出行之事。又主求事迅速，游行皆利，逃避远去，走失难寻，其余皆利。",
  tianYi: "天医：主与医药有关，利求医。",
  yueYan: "月厌：主鬼神相扰，被人诅咒，不利婚姻。",
  shengQi: "生气：主难中有救，绝处逢生，所为皆美。",
  siQi: "死气：主死丧之事，病讼，孕产皆忌。",
  siShen: "死神：主死丧疾病，占病凶。",
  tianGui: "天鬼：主流行性疾病，家有怪异。",
  xueZhi: "血支：主血光血病，产孕疾病忌见。",
  chengShen: "成神：主成合事体。所谋得遂。",
  xinShen: "信神：主文书，信息。",
  taiYang: "太阳：主光明，希望，往好处发展。",
  sangMen: "丧门：主死丧，孝服，哭泣。",
  taiYin: "太阴：主和合，隐私，感情事。",
  guanFu: "官符：主口舌官讼，小人陷害。",
  siFu: "死符：主灾病，死亡，破耗。",
  suiPo: "岁破：主大的破损，消耗，不利母亲。",
  longDe: "龙德：主恩庆，散病讼。",
  baiHu: "白虎：主哭泣，血光，死亡之事，不利小儿。",
  fuDe: "福德：主福气财利，有阴神庇佑。",
  diaoKe: "吊客：主惊忧，阴私，灾患之事，占病凶。",
  bingFu: "病符：主疾病，衰弱，也主陈年旧事。",
  tianXi: "天喜：主喜庆，恩泽，迁官，财喜等",
  tianShe: "天赦：主消灾解难，可以逢凶化吉",
};

// TODO 奇格信息
export const qiGe = {};
